![rmotr](https://user-images.githubusercontent.com/7065401/52071918-bda15380-2562-11e9-828c-7f95297e4a82.png)
<hr style="margin-bottom: 40px;">

# Pandas DataFrame exercises

ðŸ§  This notebook was created by `FreeCodeCamp` as a part of their `Data Analysis with Python` course.

âœ… The problems were solved through my own efforts.

In [2]:
# Import the numpy package under the name np
import numpy as np

# Import the pandas package under the name pd
import pandas as pd

# Import the matplotlib package under the name plt
import matplotlib.pyplot as plt
%matplotlib inline

# Print the pandas version and the configuration
print(pd.__version__)

2.2.3



## DataFrame creation

### Create an empty pandas DataFrame

In [9]:
pd.DataFrame(data=[None], index=[None], columns=[None])

      None
None  None

<img width=400 src="https://cdn.dribbble.com/users/4678/screenshots/1986600/avengers.png"></img>



### Create a `marvel_df` pandas DataFrame with the given marvel data

In [11]:
marvel_data = [
    ['Spider-Man', 'male', 1962],
    ['Captain America', 'male', 1941],
    ['Wolverine', 'male', 1974],
    ['Iron Man', 'male', 1963],
    ['Thor', 'male', 1963],
    ['Thing', 'male', 1961],
    ['Mister Fantastic', 'male', 1961],
    ['Hulk', 'male', 1962],
    ['Beast', 'male', 1963],
    ['Invisible Woman', 'female', 1961],
    ['Storm', 'female', 1975],
    ['Namor', 'male', 1939],
    ['Hawkeye', 'male', 1964],
    ['Daredevil', 'male', 1964],
    ['Doctor Strange', 'male', 1963],
    ['Hank Pym', 'male', 1962],
    ['Scarlet Witch', 'female', 1964],
    ['Wasp', 'female', 1963],
    ['Black Widow', 'female', 1964],
    ['Vision', 'male', 1968]
]

In [14]:
marvel_df =  pd.DataFrame(marvel_data)
marvel_df.head()

                 0     1     2
0       Spider-Man  male  1962
1  Captain America  male  1941
2        Wolverine  male  1974
3         Iron Man  male  1963
4             Thor  male  1963



### Add column names to the `marvel_df`

In [15]:
col_name = ['name', 'sex', 'first_appearance']
marvel_df.columns = col_name
marvel_df.head()

              name   sex  first_appearance
0       Spider-Man  male              1962
1  Captain America  male              1941
2        Wolverine  male              1974
3         Iron Man  male              1963
4             Thor  male              1963



### Add index names to the `marvel_df` (use the character name as index)

In [16]:
marvel_df.index = marvel_df['name']
marvel_df.head()

                            name   sex  first_appearance
name
Spider-Man            Spider-Man  male              1962
Captain America  Captain America  male              1941
Wolverine              Wolverine  male              1974
Iron Man                Iron Man  male              1963
Thor                        Thor  male              1963



### Drop the name column as it's now the index

In [26]:
# marvel_df.drop(['name'], axis= 1, inplace=True)
marvel_df.head()

                  sex  first_appearance
name
Spider-Man       male              1962
Captain America  male              1941
Wolverine        male              1974
Iron Man         male              1963
Thor             male              1963



### Drop 'Namor' and 'Hank Pym' rows

In [22]:
marvel_df.drop(['Namor', 'Hank Pym']).head()

                            name   sex  first_appearance
name
Spider-Man            Spider-Man  male              1962
Captain America  Captain America  male              1941
Wolverine              Wolverine  male              1974
Iron Man                Iron Man  male              1963
Thor                        Thor  male              1963



## DataFrame selection, slicing and indexation

### Show the first 5 elements on `marvel_df`

In [27]:
marvel_df.head()

                  sex  first_appearance
name
Spider-Man       male              1962
Captain America  male              1941
Wolverine        male              1974
Iron Man         male              1963
Thor             male              1963



### Show the last 5 elements on `marvel_df`

In [28]:
marvel_df.tail()

                  sex  first_appearance
name
Hank Pym         male              1962
Scarlet Witch  female              1964
Wasp           female              1963
Black Widow    female              1964
Vision           male              1968



### Show just the sex of the first 5 elements on `marvel_df`

In [32]:
marvel_df.iloc[:5].sex.to_frame()

                  sex
name
Spider-Man       male
Captain America  male
Wolverine        male
Iron Man         male
Thor             male



### Show the first_appearance of all middle elements on `marvel_df`

In [33]:
marvel_df.iloc[1:-1].first_appearance.to_frame()

                  first_appearance
name
Captain America               1941
Wolverine                     1974
Iron Man                      1963
Thor                          1963
Thing                         1961
Mister Fantastic              1961
Hulk                          1962
Beast                         1963
Invisible Woman               1961
Storm                         1975
Namor                         1939
Hawkeye                       1964
Daredevil                     1964
Doctor Strange                1963
Hank Pym                      1962
Scarlet Witch                 1964
Wasp                          1963
Black Widow                   1964



### Show the first and last elements on `marvel_df`

In [35]:
marvel_df.iloc[[0, -1]]

             sex  first_appearance
name
Spider-Man  male              1962
Vision      male              1968



## DataFrame manipulation and operations

### Modify the `first_appearance` of 'Vision' to year 1964

In [ ]:
#Â your code goes here



### Add a new column to `marvel_df` called 'years_since' with the years since `first_appearance`

In [ ]:
#Â your code goes here



## DataFrame boolean arrays (also called masks)

### Given the `marvel_df` pandas DataFrame, make a mask showing the female characters

In [ ]:
#Â your code goes here



### Given the `marvel_df` pandas DataFrame, get the male characters

In [ ]:
#Â your code goes here



### Given the `marvel_df` pandas DataFrame, get the characters with `first_appearance` after 1970

In [ ]:
#Â your code goes here



### Given the `marvel_df` pandas DataFrame, get the female characters with `first_appearance` after 1970

In [ ]:
#Â your code goes here



## DataFrame summary statistics

###Â Show basic statistics of `marvel_df`

In [ ]:
#Â your code goes here



### Given the `marvel_df` pandas DataFrame, show the mean value of `first_appearance`

In [ ]:
#Â your code goes here



### Given the `marvel_df` pandas DataFrame, show the min value of `first_appearance`

In [ ]:
#Â your code goes here



### Given the `marvel_df` pandas DataFrame, get the characters with the min value of `first_appearance`

In [ ]:
#Â your code goes here



## DataFrame basic plottings

### Reset index names of `marvel_df`

In [ ]:
#Â your code goes here



###Â Plot the values of `first_appearance`

In [ ]:
#Â your code goes here



###Â Plot a histogram (plot.hist) with values of `first_appearance`

In [ ]:
#Â your code goes here